"""Bulgarian bank BIC codes and names."""

BANK_CODES: dict[str, str] = {
    "UNCR": "УниКредит Булбанк",
    "STSA": "Банка ДСК",
    "FINV": "Първа инвестиционна банка",
    "BNBG": "Българска народна банка",
    "BPBI": "Пощенска банка",
    "CECB": "Централна кооперативна банка",
    "UBBS": "Обединена българска банка",
    "IORT": "Инвестбанк",
    "RZBB": "Райфайзенбанк България",
    "TTBB": "Ти Би Ай Банк",
    "SOMB": "Общинска банка",
    "BNPA": "БНП Париба",
    "DEMI": "Ди Коммерс Банк",
    "BUIB": "Алианц Банк България",
    "NASB": "Интернешънъл Асет Банк",
}
